// Кирпа Артемий 
// ЭФБО-08-26
// ЗАДАНИЯ 1-3 


// задание 1 

// #include <iostream>
// using namespace std;

// int main() {
//     int a;
//     int b; 
//     cin >> a;
//     cin >> b; 
//     a = a + b;
//     b = a - b;
//     a = a - b;
//     cout << a << " " << b;
//     return 0;
// }




// Задание 2

// #include <iostream>
// using namespace std;

// int main() {
//     int n;
//     cin >> n;
//     int f = 1; // текущий факториал
//     int p = 1; // произведение факториалов
//     for (int i = 1; i <= n; i++) {
//         f = f * i;
//         p = p * f;
//     }
//     cout << p;
//     return 0;
// }




// Задание 3 

// #include <iostream>
// using namespace std;

// int main() {
//     int a;
//     cin >> a;
//     int b = 2 - a;
//     cout << b;
//     return 0;
// }


// Практическое занятие позволило применить теоретические знания по основам C++
// для решения конкретных алгоритмических задач.
// Мы научились писать компактный и эффективный код, а также научились беглому чтению кода. 
// Полученные навыки будут использоваться в дальнейших практических занятиях по дисциплине
